### Import the library pandas as pd

#### Import արեք pandas գրադարանը pd  անունով

In [1]:
import pandas as pd
import numpy as np
from datetime import date

### Import the dataset gender.txt, assign to a variable gender

### Import արեք gender.txt dataset-ը, վերագրեք այն gender փոփոխականին

In [38]:
gender = pd.read_csv('gender.txt', sep = '|')

### Check the datatypes in the dataframe

### Ստուգեք աղյուսակի սյուների տիպերը

In [3]:
gender.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Convert the datatype of the column 'occupation' into categorical

### Վերածեք 'occupation' սյունը categorical տիպի

In [4]:
gender.occupation = gender.occupation.astype('category')

In [5]:
gender.dtypes

user_id          int64
age              int64
gender          object
occupation    category
zip_code        object
dtype: object

### Replace the values in the column 'gender' with Male and Female accordingly. Do this with 2 methods: using apply and map.

### Փոխարինեք  'gender' սյան արժեքները Male և Female արժեքներով, արեք սա երկու տարբերակով՝ գործածելով apply և map ֆունկցիաները

In [6]:
gender.gender.map({'M':'Male','F':'Female'})

0        Male
1      Female
2        Male
3        Male
4      Female
        ...
938    Female
939      Male
940      Male
941    Female
942      Male
Name: gender, Length: 943, dtype: object

In [7]:
def cat(c):
    if "M" in c:
        return "Male"
    else:
        return "Female"

In [8]:
gender.gender.apply(cat)

0        Male
1      Female
2        Male
3        Male
4      Female
        ...
938    Female
939      Male
940      Male
941    Female
942      Male
Name: gender, Length: 943, dtype: object

### Calculate the mean, median and std of age values for each occupation

### Հաշվեք age սյան mean, median և std արժեքները occupation սյան ամեն արժեքի համար

In [9]:
gender.groupby('occupation').age.agg([np.mean, np.median, np.std])

                    mean  median        std
occupation
administrator  38.746835    37.0  11.123397
artist         31.392857    30.0   8.668116
doctor         43.571429    45.0  12.501428
educator       42.010526    42.0  10.413264
engineer       36.388060    36.0  11.199236
entertainment  29.222222    25.0  10.056052
executive      38.718750    38.5  10.608075
healthcare     41.562500    44.5  11.313524
homemaker      32.571429    32.0  10.737119
lawyer         36.750000    34.0  10.830303
librarian      40.000000    39.0  11.023611
marketing      37.615385    36.0   9.474500
none           26.555556    26.0  13.757826
other          34.523810    32.0  10.738227
programmer     33.121212    30.0   9.624512
retired        63.071429    63.0   5.757461
salesman       35.666667    34.0  14.079859
scientist      35.548387    37.0   7.392964
student        22.081633    21.0   5.284081
technician     33.148148    30.0   9.867210
writer         36.311111    36.0  11.423306

### Create a new column 'birth_year' and get the birth year of each individual using the values from the column 'age'

### Ստեղծեք 'birth_year' անունով նոր սյուն, որում կպահեք ամեն մարդու ծննդյան տարին, որը կստանաք օգտագործելով 'birth_year' սյան արժեքները

In [10]:
day = date.today()
gender['birth_year'] = day.year - gender.age

In [11]:
gender

     user_id  age gender     occupation zip_code  birth_year
0          1   24      M     technician    85711        1997
1          2   53      F          other    94043        1968
2          3   23      M         writer    32067        1998
3          4   24      M     technician    43537        1997
4          5   33      F          other    15213        1988
..       ...  ...    ...            ...      ...         ...
938      939   26      F        student    33319        1995
939      940   32      M  administrator    02215        1989
940      941   20      M        student    97229        2001
941      942   48      F      librarian    78209        1973
942      943   22      M        student    77841        1999

[943 rows x 6 columns]

### Create a new column 'birth_date' using the column 'birth_year' and current month and day values"

### Ստեղծեք 'birth_date' անունով նոր սյուն, որի արժեքները կստանաք գործածելով 'birth_year' սյան արժեքները ինչպես նաև այս պահի ամիսն ու օրը։

In [12]:
gender['birth_date'] = gender.birth_year.astype(str) + '/' + str(day.month) + '/' + str(day.day)

### Make sure the datatype of the columns 'birth_year' and 'birth_date' is datetime

### Վստահ եղեք, որ 'birth_year' և 'birth_date' սյուները datetime տիպի են

In [13]:
gender.dtypes

user_id          int64
age              int64
gender          object
occupation    category
zip_code        object
birth_year       int64
birth_date      object
dtype: object

In [17]:
gender['birth_year'] = pd.to_datetime(gender['birth_year'])
gender['birth_date'] = pd.to_datetime(gender['birth_date'])

In [15]:
gender.dtypes

user_id                     int64
age                         int64
gender                     object
occupation               category
zip_code                   object
birth_year    datetime64[ns, UTC]
birth_date    datetime64[ns, UTC]
dtype: object

### Change the values in the column user_id to have the values of type string of the same length (use the method of your choice). As an example, if we have values 0, 1 and 100, we could have values '000', '001' and '100' as a result.

### Փոխեք user_id սյան արժեքները նույն երկարություն ունեցող string տիպի արժեքներով՝ գործածելով Ձեր ցանկացած մեթոդը։ Որպես օրինակ, եթե ունեք 0, 1 և 100 աևժեքներ, Ձեր արդյունքը կարող է լինել '000', '001' և'100'

In [36]:
e = []
for i in range(len(gender.user_id)):
    if len(str(gender.user_id[i])) == 1:
        e.append('00'+str(gender.user_id[i]))
    elif len(str(gender.user_id[i])) == 2:
        e.append('0'+str(gender.user_id[i]))
    else:
        e.append(str(gender.user_id[i]))
gender.user_id = e